<template>
    <div >
        <b-row>
            <b-col cols="8" >
                <p class="mainText">Safe Space
                </p>
            </b-col>
            <b-col class="description">
                <p style="padding: 10px">
                    Привет моим новым читателям! Во время моего полового созревания рядом было очень много близких и
                    желающих помочь людей, но я это игнорировала. И да, я сказала «помочь», потому что для каждой
                    девочки это особый и сложный путь, состоящий из борьбы с собой, со своими страхами, изменениями
                    во всём: внешности, вкусах, внутреннем состоянии и желаниях. Это путающий, смущающий, но открывающий
                    кучу возможностей период. Взрослеющим девушкам как никогда нужна поддержка и навигация. И as much as
                    я хочу, чтобы вы больше открывались своей семье о ваших личных проблемах, я также понимаю, насколько
                    это сложно. Поэтому начинаю этот блог. Для того, чтобы читать мой блог, тебе не надо говорить вслух
                    о своих проблемах, никто не видит читателей. Ты так же можешь в любое время суток написать мне,
                    и мы можем поговорить. Все твои тайны и страхи останутся между нами. Если ты девочка в пубертатном
                    периоде, и тебе страшно, и кажется, что ты одна, этот блог для тебя, и я здесь, чтобы помочь.
                </p>
            </b-col>
        </b-row>
        <br>

    </div>
</template>

<script>
    export default {
        name: "mainContent"
    }
</script>

<style scoped>
    .description{
        margin-top: 15px;
        background-color: rgba(255, 255, 255, 0.6);
        border-radius: 5px;
        font: normal normal 110% Serif;
        color: #422d61;
    }

    .mainText{
        display: flex;
        justify-content: center; /*Центрирование по горизонтали*/
        position: absolute;
        top: 50%;
        left: 35%;
        color: #422d61;
        font: normal normal 300% Serif;
    }
</style>